#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/54a6b927-f8e1-4238-8642-f64fbdd2d9f1/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.network.azurerm_virtual_network.this has changed
  ~ resource "azurerm_virtual_network" "this" {
        id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod"
        name                    = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod"
      ~ subnet                  = [
          + {
              + address_prefix = "10.240.0.0/26"
              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/serverFarm"
              + name           = "serverFarm"
              + security_group = ""
            },
          + {
              + address_prefix = "10.240.0.64/26"
              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/ingress"
              + name           = "ingress"
              + security_group = ""
            },
          + {
              + address_prefix = "10.240.10.128/26"
              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/devops"
              + name           = "devops"
              + security_group = ""
            },
          + {
              + address_prefix = "10.240.11.0/24"
              + id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/privateLink"
              + name           = "privateLink"
              + security_group = ""
            },
        ]
        tags                    = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "network"
        }
        # (6 unchanged attributes hidden)
    }

  # module.private_dns_zones[0].azurerm_private_dns_zone.this has changed
  ~ resource "azurerm_private_dns_zone" "this" {
        id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
        name                                                  = "privatelink.azurewebsites.net"
      ~ number_of_record_sets                                 = 1 -> 5
        tags                                                  = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "private-dns-zone"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.private_dns_zones[1].azurerm_private_dns_zone.this has changed
  ~ resource "azurerm_private_dns_zone" "this" {
        id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net"
        name                                                  = "privatelink.database.windows.net"
      ~ number_of_record_sets                                 = 1 -> 2
        tags                                                  = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "private-dns-zone"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.private_dns_zones[2].azurerm_private_dns_zone.this has changed
  ~ resource "azurerm_private_dns_zone" "this" {
        id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.azconfig.io"
        name                                                  = "privatelink.azconfig.io"
      ~ number_of_record_sets                                 = 1 -> 2
        tags                                                  = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "private-dns-zone"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.private_dns_zones[3].azurerm_private_dns_zone.this has changed
  ~ resource "azurerm_private_dns_zone" "this" {
        id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
        name                                                  = "privatelink.vaultcore.azure.net"
      ~ number_of_record_sets                                 = 1 -> 2
        tags                                                  = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "private-dns-zone"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.private_dns_zones[4].azurerm_private_dns_zone.this has changed
  ~ resource "azurerm_private_dns_zone" "this" {
        id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
        name                                                  = "privatelink.redis.cache.windows.net"
      ~ number_of_record_sets                                 = 1 -> 2
        tags                                                  = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "private-dns-zone"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurecaf_name.appsvc_subnet must be replaced
-/+ resource "azurecaf_name" "appsvc_subnet" {
      ~ id            = "bhvjbwlscqphkcyx" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            # (1 unchanged element hidden)
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "spoke-sec-baseline-1-spoke-westus3-snet-eslz1" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurecaf_name.caf_name_id_contributor must be replaced
-/+ resource "azurecaf_name" "caf_name_id_contributor" {
      ~ id            = "dnlsksyhpkhsnwdj" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-msi-eslz1-contributor" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurecaf_name.caf_name_id_reader must be replaced
-/+ resource "azurecaf_name" "caf_name_id_reader" {
      ~ id            = "jvaiptpdjdabmpiw" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-msi-eslz1-reader" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurecaf_name.caf_name_law must be replaced
-/+ resource "azurecaf_name" "caf_name_law" {
      ~ id            = "dmgjkgiqpambjtxs" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-log-eslz1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurecaf_name.caf_name_spoke_rg must be replaced
-/+ resource "azurecaf_name" "caf_name_spoke_rg" {
      ~ id            = "yhpfxpcghfwqecxw" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            # (1 unchanged element hidden)
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurecaf_name.law must be replaced
-/+ resource "azurecaf_name" "law" {
      ~ id            = "deeavlehsaejricp" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ result        = "log-eslz1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.law must be replaced
-/+ resource "azurerm_log_analytics_workspace" "law" {
      - cmk_for_query_forced            = false -> null
      ~ id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.OperationalInsights/workspaces/log-eslz1-prod" -> (known after apply)
      ~ location                        = "westus3" -> "westus2" # forces replacement
      ~ name                            = "log-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ primary_shared_key              = (sensitive value)
      ~ resource_group_name             = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_shared_key            = (sensitive value)
        tags                            = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
        }
      ~ workspace_id                    = "d011dd81-1237-42e0-9c8b-79b15170a2e9" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_resource_group.spoke must be replaced
-/+ resource "azurerm_resource_group" "spoke" {
      ~ id       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1" -> (known after apply)
      ~ location = "westus3" -> "westus2" # forces replacement
      ~ name     = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
        tags     = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
        }
    }

  # azurerm_user_assigned_identity.contributor must be replaced
-/+ resource "azurerm_user_assigned_identity" "contributor" {
      ~ client_id           = "5b6d3e0a-cb5f-469c-8a03-5e84c1cbf762" -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sec-baseline-1-spoke-westus3-msi-eslz1-contributor" -> (known after apply)
      ~ location            = "westus3" -> "westus2" # forces replacement
      ~ name                = "sec-baseline-1-spoke-westus3-msi-eslz1-contributor" # forces replacement -> (known after apply) # forces replacement
      ~ principal_id        = "949b4b4e-86eb-432e-b8b3-2ae1fd287991" -> (known after apply)
      ~ resource_group_name = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - tags                = {} -> null
      ~ tenant_id           = "449fbe1d-9c99-4509-9014-4fd5cf25b014" -> (known after apply)
    }

  # azurerm_user_assigned_identity.reader must be replaced
-/+ resource "azurerm_user_assigned_identity" "reader" {
      ~ client_id           = "3efaf752-dfe8-4940-ac81-66b619bb3745" -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sec-baseline-1-spoke-westus3-msi-eslz1-reader" -> (known after apply)
      ~ location            = "westus3" -> "westus2" # forces replacement
      ~ name                = "sec-baseline-1-spoke-westus3-msi-eslz1-reader" # forces replacement -> (known after apply) # forces replacement
      ~ principal_id        = "e33a5214-9e5c-472e-8fb8-f8c39ab3e461" -> (known after apply)
      ~ resource_group_name = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - tags                = {} -> null
      ~ tenant_id           = "449fbe1d-9c99-4509-9014-4fd5cf25b014" -> (known after apply)
    }

  # module.app_configuration[0].azurecaf_name.caf_name_appconf must be replaced
-/+ resource "azurecaf_name" "caf_name_appconf" {
      ~ id            = "tvaqutjmtrvbvety" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurecaf_name.private_endpoint must be replaced
-/+ resource "azurecaf_name" "private_endpoint" {
      ~ id            = "jxmdskntabkbvfia" -> (known after apply)
      ~ name          = "sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ result        = "pe-sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurerm_app_configuration.this must be replaced
-/+ resource "azurerm_app_configuration" "this" {
      ~ endpoint                   = "https://sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461.azconfig.io" -> (known after apply)
      ~ id                         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.AppConfiguration/configurationStores/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" -> (known after apply)
      ~ location                   = "westus3" -> "westus2" # forces replacement
      ~ name                       = "sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ primary_read_key           = [] -> (known after apply)
      ~ primary_write_key          = [] -> (known after apply)
      ~ resource_group_name        = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_read_key         = [] -> (known after apply)
      ~ secondary_write_key        = [] -> (known after apply)
        tags                       = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "app-configuration"
        }
        # (5 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurerm_private_dns_a_record.this must be replaced
-/+ resource "azurerm_private_dns_a_record" "this" {
      ~ fqdn                = "sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461.privatelink.azconfig.io." -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.azconfig.io/A/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" -> (known after apply)
      ~ name                = "sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ records             = [
          - "10.240.11.4",
        ] -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [
          - {
              - fqdn         = "sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461.azconfig.io"
              - ip_addresses = [
                  - "10.240.11.4",
                ]
            },
        ] -> (known after apply)
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/privateEndpoints/pe-sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" -> (known after apply)
      ~ location                 = "westus3" -> "westus2" # forces replacement
      ~ name                     = "pe-sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/networkInterfaces/pe-sec-baseline-1-spoke-westus3-appcg-eslz1.nic.390eab13-fd68-4e80-bb11-2ecd7f49edec"
              - name = "pe-sec-baseline-1-spoke-westus3-appcg-eslz1.nic.390eab13-fd68-4e80-bb11-2ecd7f49edec"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [] -> (known after apply)
      ~ resource_group_name      = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/privateLink" # forces replacement -> (known after apply) # forces replacement
      - tags                     = {} -> null

      ~ private_service_connection {
            name                           = "app-config-private-endpoint"
          ~ private_connection_resource_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.AppConfiguration/configurationStores/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.240.11.4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.app_configuration[0].azurerm_role_assignment.data_owners[0] must be replaced
-/+ resource "azurerm_role_assignment" "data_owners" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.AppConfiguration/configurationStores/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461/providers/Microsoft.Authorization/roleAssignments/af608b42-4749-da08-d090-57c2feb3fbac" -> (known after apply)
      ~ name                             = "af608b42-4749-da08-d090-57c2feb3fbac" -> (known after apply)
      ~ principal_id                     = "949b4b4e-86eb-432e-b8b3-2ae1fd287991" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/5ae67dd6-50cb-40e7-96ff-dc2bfa4b606b" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.AppConfiguration/configurationStores/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app_configuration[0].azurerm_role_assignment.data_readers[0] must be replaced
-/+ resource "azurerm_role_assignment" "data_readers" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.AppConfiguration/configurationStores/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461/providers/Microsoft.Authorization/roleAssignments/d67f6551-6738-e975-af28-77f05976002a" -> (known after apply)
      ~ name                             = "d67f6551-6738-e975-af28-77f05976002a" -> (known after apply)
      ~ principal_id                     = "e33a5214-9e5c-472e-8fb8-f8c39ab3e461" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/516239f1-63e1-4d78-a4de-a74fb236a071" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.AppConfiguration/configurationStores/sec-baseline-1-spoke-westus3-appcg-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app_service.azurecaf_name.caf_name_appinsights must be replaced
-/+ resource "azurecaf_name" "caf_name_appinsights" {
      ~ id            = "xcdytgfueolnctqo" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-appi-eslz1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app_service.azurecaf_name.caf_name_asp must be replaced
-/+ resource "azurecaf_name" "caf_name_asp" {
      ~ id            = "xqnjrrtjgoabvuke" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "westus3-plan-eslz1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app_service.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "4bb411f1-e975-444a-b559-823aa404d4ff" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Insights/components/sec-baseline-1-spoke-westus3-appi-eslz1-prod" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westus3" -> "westus2" # forces replacement
      ~ name                                  = "sec-baseline-1-spoke-westus3-appi-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name                   = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - tags                                  = {} -> null
      ~ workspace_id                          = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.OperationalInsights/workspaces/log-eslz1-prod" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.app_service.azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Web/serverfarms/westus3-plan-eslz1-prod" -> (known after apply)
      ~ kind                         = "app" -> (known after apply)
      ~ location                     = "westus3" -> "westus2" # forces replacement
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "westus3-plan-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ reserved                     = false -> (known after apply)
      ~ resource_group_name          = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
        tags                         = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "app-service"
        }
        # (5 unchanged attributes hidden)
    }

  # module.frontdoor.azurecaf_name.caf_name_afd must be replaced
-/+ resource "azurecaf_name" "caf_name_afd" {
      ~ id            = "vjxqvtjmemddjsyg" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-fd-eslz1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.frontdoor.azurerm_cdn_frontdoor_firewall_policy.waf[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      - custom_block_response_status_code = 0 -> null
      ~ frontend_endpoint_ids             = [] -> (known after apply)
      ~ id                                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/wafpolicymicrosoftdefaultruleset21" -> (known after apply)
        name                              = "wafpolicymicrosoftdefaultruleset21"
      ~ resource_group_name               = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - tags                              = {} -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.frontdoor must be replaced
-/+ resource "azurerm_cdn_frontdoor_profile" "frontdoor" {
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cdn/profiles/sec-baseline-1-spoke-westus3-fd-eslz1-prod" -> (known after apply)
      ~ name                     = "sec-baseline-1-spoke-westus3-fd-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name      = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ resource_guid            = "a1cefc33-bf49-4155-a28a-d253ba7f23cd" -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "frontdoor"
        }
        # (2 unchanged attributes hidden)
    }

  # module.frontdoor.azurerm_cdn_frontdoor_security_policy.web_app_waf[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "web_app_waf" {
      ~ cdn_frontdoor_profile_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cdn/profiles/sec-baseline-1-spoke-westus3-fd-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cdn/profiles/sec-baseline-1-spoke-westus3-fd-eslz1-prod/securityPolicies/WAF-Security-Policy" -> (known after apply)
        name                     = "WAF-Security-Policy"

      ~ security_policies {
          ~ firewall {
              ~ cdn_frontdoor_firewall_policy_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/wafpolicymicrosoftdefaultruleset21" # forces replacement -> (known after apply) # forces replacement

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cdn/profiles/sec-baseline-1-spoke-westus3-fd-eslz1-prod/afdEndpoints/eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.frontdoor.azurerm_monitor_diagnostic_setting.this[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "this" {
      ~ id                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cdn/profiles/sec-baseline-1-spoke-westus3-fd-eslz1-prod|sec-baseline-1-spoke-westus3-fd-eslz1-prod-diagnostic-settings}" -> (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      ~ log_analytics_workspace_id     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.OperationalInsights/workspaces/log-eslz1-prod" -> (known after apply)
      ~ name                           = "sec-baseline-1-spoke-westus3-fd-eslz1-prod-diagnostic-settings}" # forces replacement -> (known after apply) # forces replacement
      ~ target_resource_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cdn/profiles/sec-baseline-1-spoke-westus3-fd-eslz1-prod" # forces replacement -> (known after apply) # forces replacement

      - log {
          - category_group = "allLogs" -> null
          - enabled        = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category_group = "audit" -> null
          - enabled        = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurecaf_name.caf_name_akv must be replaced
-/+ resource "azurecaf_name" "caf_name_akv" {
      ~ id            = "rfuhnmjbhvbivisd" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "kv-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.key_vault.azurecaf_name.private_endpoint must be replaced
-/+ resource "azurecaf_name" "private_endpoint" {
      ~ id            = "lbivgljqkjfyetww" -> (known after apply)
      ~ name          = "kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ result        = "pe-kv-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault.this must be replaced
-/+ resource "azurerm_key_vault" "this" {
      ~ access_policy                   = [] -> (known after apply)
      - enabled_for_deployment          = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.KeyVault/vaults/kv-eslz1-prod-5461" -> (known after apply)
      ~ location                        = "westus3" -> "westus2" # forces replacement
      ~ name                            = "kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name             = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
        tags                            = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "key-vault"
        }
      ~ vault_uri                       = "https://kv-eslz1-prod-5461.vault.azure.net/" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.key_vault.azurerm_private_dns_a_record.this must be replaced
-/+ resource "azurerm_private_dns_a_record" "this" {
      ~ fqdn                = "kv-eslz1-prod-5461.privatelink.vaultcore.azure.net." -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/A/kv-eslz1-prod-5461" -> (known after apply)
      ~ name                = "kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ records             = [
          - "10.240.11.6",
        ] -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [
          - {
              - fqdn         = "kv-eslz1-prod-5461.vault.azure.net"
              - ip_addresses = [
                  - "10.240.11.6",
                ]
            },
        ] -> (known after apply)
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/privateEndpoints/pe-kv-eslz1-prod-5461" -> (known after apply)
      ~ location                 = "westus3" -> "westus2" # forces replacement
      ~ name                     = "pe-kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/networkInterfaces/pe-kv-eslz1-prod-5461.nic.33c3581f-dfff-4356-b276-0b918059f443"
              - name = "pe-kv-eslz1-prod-5461.nic.33c3581f-dfff-4356-b276-0b918059f443"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [] -> (known after apply)
      ~ resource_group_name      = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/privateLink" # forces replacement -> (known after apply) # forces replacement
      - tags                     = {} -> null

      ~ private_service_connection {
          ~ name                           = "pe-kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_connection_resource_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.KeyVault/vaults/kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.240.11.6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.key_vault.azurerm_role_assignment.secrets_officer[0] must be replaced
-/+ resource "azurerm_role_assignment" "secrets_officer" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.KeyVault/vaults/kv-eslz1-prod-5461/providers/Microsoft.Authorization/roleAssignments/914e8bf0-dbc7-bc9b-2d93-fd8cf928e24e" -> (known after apply)
      ~ name                             = "914e8bf0-dbc7-bc9b-2d93-fd8cf928e24e" -> (known after apply)
      ~ principal_id                     = "949b4b4e-86eb-432e-b8b3-2ae1fd287991" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.KeyVault/vaults/kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.key_vault.azurerm_role_assignment.secrets_user[0] must be replaced
-/+ resource "azurerm_role_assignment" "secrets_user" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.KeyVault/vaults/kv-eslz1-prod-5461/providers/Microsoft.Authorization/roleAssignments/f11970d7-041d-3036-d1e3-dbe0a4f267c9" -> (known after apply)
      ~ name                             = "f11970d7-041d-3036-d1e3-dbe0a4f267c9" -> (known after apply)
      ~ principal_id                     = "e33a5214-9e5c-472e-8fb8-f8c39ab3e461" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.KeyVault/vaults/kv-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.network.azurecaf_name.caf_name_vnet must be replaced
-/+ resource "azurecaf_name" "caf_name_vnet" {
      ~ id            = "wrcubxisxkppqukq" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.network.azurerm_subnet.this[0] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/serverFarm" -> (known after apply)
        name                                           = "serverFarm"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.network.azurerm_subnet.this[1] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/ingress" -> (known after apply)
        name                                           = "ingress"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet.this[2] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/devops" -> (known after apply)
        name                                           = "devops"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet.this[3] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/privateLink" -> (known after apply)
        name                                           = "privateLink"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "26abb02b-d37e-4084-9af0-8956b86e48ba" -> (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod" -> (known after apply)
      ~ location                = "westus3" -> "westus2" # forces replacement
      ~ name                    = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.240.0.0/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/serverFarm"
              - name           = "serverFarm"
              - security_group = ""
            },
          - {
              - address_prefix = "10.240.0.64/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/ingress"
              - name           = "ingress"
              - security_group = ""
            },
          - {
              - address_prefix = "10.240.10.128/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/devops"
              - name           = "devops"
              - security_group = ""
            },
          - {
              - address_prefix = "10.240.11.0/24"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/privateLink"
              - name           = "privateLink"
              - security_group = ""
            },
        ] -> (known after apply)
        tags                    = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "network"
        }
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_virtual_network_peering.target_to_this[0] must be replaced
-/+ resource "azurerm_virtual_network_peering" "target_to_this" {
      ~ id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/virtualNetworkPeerings/hub-to-spoke-eslz1" -> (known after apply)
      ~ name                         = "hub-to-spoke-eslz1" -> "hub-to-spoke-eslz2" # forces replacement
      ~ remote_virtual_network_id    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.network.azurerm_virtual_network_peering.this_to_target[0] must be replaced
-/+ resource "azurerm_virtual_network_peering" "this_to_target" {
      ~ id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/virtualNetworkPeerings/spoke-to-hub-eslz1" -> (known after apply)
      ~ name                         = "spoke-to-hub-eslz1" -> "spoke-to-hub-eslz2" # forces replacement
      ~ resource_group_name          = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ virtual_network_name         = "sec-baseline-1-spoke-westus3-vnet-eslz1-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.redis_cache[0].azurecaf_name.caf_name_redis must be replaced
-/+ resource "azurecaf_name" "caf_name_redis" {
      ~ id            = "qmdwakptsqrwgxse" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.redis_cache[0].azurecaf_name.private_endpoint must be replaced
-/+ resource "azurecaf_name" "private_endpoint" {
      ~ id            = "arfqxqwlltqcwxqo" -> (known after apply)
      ~ name          = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ result        = "pe-sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.redis_cache[0].azurerm_private_dns_a_record.this must be replaced
-/+ resource "azurerm_private_dns_a_record" "this" {
      ~ fqdn                = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461.privatelink.redis.cache.windows.net." -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/A/sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" -> (known after apply)
      ~ name                = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ records             = [
          - "10.240.11.7",
        ] -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.redis_cache[0].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [
          - {
              - fqdn         = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461.redis.cache.windows.net"
              - ip_addresses = [
                  - "10.240.11.7",
                ]
            },
        ] -> (known after apply)
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/privateEndpoints/pe-sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" -> (known after apply)
      ~ location                 = "westus3" -> "westus2" # forces replacement
      ~ name                     = "pe-sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/networkInterfaces/pe-sec-baseline-1-spoke-westus3-redis-eslz1.nic.2fda8657-9d6b-4e08-83c1-5802ef5ef09e"
              - name = "pe-sec-baseline-1-spoke-westus3-redis-eslz1.nic.2fda8657-9d6b-4e08-83c1-5802ef5ef09e"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [] -> (known after apply)
      ~ resource_group_name      = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-spoke-westus3-vnet-eslz1-prod/subnets/privateLink" # forces replacement -> (known after apply) # forces replacement
      - tags                     = {} -> null

      ~ private_service_connection {
          ~ name                           = "pe-sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_connection_resource_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cache/redis/sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.240.11.7" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.redis_cache[0].azurerm_redis_cache.this must be replaced
-/+ resource "azurerm_redis_cache" "this" {
      ~ hostname                      = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Cache/redis/sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" -> (known after apply)
      ~ location                      = "westus3" -> "westus2" # forces replacement
      ~ name                          = "sec-baseline-1-spoke-westus3-redis-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> (known after apply)
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ resource_group_name           = "spoke-sec-baseline-1-spoke-westus3-rg-eslz1" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "redis"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 2000 -> (known after apply)
          ~ maxfragmentationmemory_reserved = 299 -> (known after apply)
          ~ maxmemory_delta                 = 299 -> (known after apply)
          ~ maxmemory_reserved              = 299 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.sql_database[0].azurecaf_name.caf_name_sqlserver must be replaced
-/+ resource "azurecaf_name" "caf_name_sqlserver" {
      ~ id            = "pmnternummrbgqpv" -> (known after apply)
      ~ name          = "eslz1" -> "eslz2" # forces replacement
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-spoke",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-spoke-westus3-sql-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sql_database[0].azurecaf_name.private_endpoint must be replaced
-/+ resource "azurecaf_name" "private_endpoint" {
      ~ id            = "eiedeunwqohdpaah" -> (known after apply)
      ~ name          = "sec-baseline-1-spoke-westus3-sql-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ result        = "pe-sec-baseline-1-spoke-westus3-sql-eslz1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sql_database[0].azurerm_mssql_database.this[0] must be replaced
-/+ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes         = 0 -> (known after apply)
      ~ collation                           = "SQL_Latin1_General_CP1_CI_AS" -> (known after apply)
      + creation_source_database_id         = (known after apply)
      ~ id                                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Sql/servers/sec-baseline-1-spoke-westus3-sql-eslz1-prod-5461/databases/sample-db" -> (known after apply)
      ~ ledger_enabled                      = false -> (known after apply)
      + license_type                        = (known after apply)
      ~ maintenance_configuration_name      = "SQL_Default" -> (known after apply)
      ~ max_size_gb                         = 250 -> (known after apply)
      ~ min_capacity                        = 0 -> (known after apply)
        name                                = "sample-db"
      ~ read_replica_count                  = 0 -> (known after apply)
      ~ read_scale                          = false -> (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      ~ server_id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/spoke-sec-baseline-1-spoke-westus3-rg-eslz1/providers/Microsoft.Sql/servers/sec-baseline-1-spoke-westus3-sql-eslz1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      - tags                                = {} -> null
      ~ zone_redundant                      = false -> (known after apply)
        # (5 unchanged attributes hidden)

      - long_term_retention_policy {
          - monthly_retention = "PT0S" -> null
          - week_of_year      = 1 -> null
          - weekly_retention  = "PT0S" -> null
          - yearly_retention  = "PT0S" -> null
        }

      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = "Disabled" -> null
          - email_addresses      = [] -> null
          - retention_days       = 0 -> null
          - state                = "Disabled" -> null
        }
    }

  # module.sql_database[0].azurerm_mssql_server.this must be replaced
-/+ resource "azurerm_mssql_server" "this" {
      ~ administrator_login                  = "CloudSA637969e7" -> (known after app ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/Azure/appservice-landing-zone-accelerator/actions/runs/5825505248">Actions</a>.<br /><br />

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-multitenant/terraform/spoke`, Workflow: `Scenario 1: Terraform SPOKE Multi-tenant Secure Baseline`*